# How work Merge functions:-

In [2]:
import pandas as pd

In [3]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var2 = pd.DataFrame({"A":[1,2,3,23],"C":[9,10,11,12]})
var3 = pd.merge(var1,var2)

# show common data

In [13]:
var11 = pd.merge(var1,var2,on="A")

In [14]:
var11

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11

In [21]:
var3

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11

In [12]:
var4 = pd.merge(var1,var2,on="A")

In [13]:
var4

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11

In [16]:
var5 = pd.merge(var1,var2,how="inner")

In [17]:
var5

   A  B   C
0  1  5   9
1  3  7  11

In [22]:
var3

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11

In [27]:
var6 = pd.merge(var1,var2,how="left")

In [28]:
var6

   A  B     C
0  1  5   9.0
1  2  6  10.0
2  3  7  11.0
3  4  8   NaN

In [29]:
var7 = pd.merge(var1,var2,how ="right")

In [30]:
var7

    A    B   C
0   1  5.0   9
1   2  6.0  10
2   3  7.0  11
3  23  NaN  12

In [4]:
var8 = pd.merge(var1,var2,left_index=True,right_index=True)

In [6]:
var9 = pd.merge(var1,var2,left_index=True,right_index=True,suffixes={"name","id"})

C:\Users\vishal\AppData\Local\Temp\ipykernel_8820\1935363361.py:1: FutureWarning: Passing 'suffixes' as a <class 'set'>, is not supported and may give unexpected results. Provide 'suffixes' as a tuple instead. In the future a 'TypeError' will be raised.
  var9 = pd.merge(var1,var2,left_index=True,right_index=True,suffixes={"name","id"})

In [7]:
var9

   Aname  B  Aid   C
0      1  5    1   9
1      2  6    2  10
2      3  7    3  11
3      4  8   23  12

In [10]:
var10 = pd.merge(var1,var2,left_index=True,right_index=True)

In [12]:
var10

   A_x  B  A_y   C
0    1  5    1   9
1    2  6    2  10
2    3  7    3  11
3    4  8   23  12